lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
#include <NimBLEDevice.h>
#include <NimBLEUtils.h>
#include <NimBLEServer.h>
#include "NimBLEHIDDevice.h"
#include "HIDTypes.h"
#include "HIDKeyboardTypes.h"
#include <driver/adc.h>
#include "sdkconfig.h"

#include "BleConnectionStatus.h"
#include "BleGamepad.h"

#if defined(CONFIG_ARDUHAL_ESP_LOG)
  #include "esp32-hal-log.h"
  #define LOG_TAG "BLEGamepad"
#else
  #include "esp_log.h"
  static const char* LOG_TAG = "BLEGamepad";
#endif

uint8_t tempHidReportDescriptor[150];
int hidReportDescriptorSize = 0;
uint8_t _hidReportId = 3;
uint8_t reportSize = 0;
uint8_t numOfButtonBytes = 0;

BleGamepad::BleGamepad(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel) :
  _controllerType(CONTROLLER_TYPE_GAMEPAD),
  _buttons(),
  _x(0),
  _y(0),
  _z(0),
  _rZ(0),
  _rX(0),
  _rY(0),
  _slider1(0),
  _slider2(0),
  _rudder(0),
  _throttle(0),
  _accelerator(0),
  _brake(0),
  _steering(0),
  _hat1(0),
  _hat2(0),
  _hat3(0),
  _hat4(0),
  _autoReport(true),
  _buttonCount(0),
  _hatSwitchCount(0),
  _includeStart(false),
  _includeSelect(false),
  _includeHome(false),
  _includeVolumeInc(false),
  _includeVolumeDec(false),
  _includeVolumeMute(false),
  _includeMenu(false),
  _includeXAxis(true),
  _includeYAxis(true),
  _includeZAxis(true),
  _includeRxAxis(true),
  _includeRyAxis(true),
  _includeRzAxis(true),
  _includeSlider1(true),
  _includeSlider2(true),
  _includeRudder(false),
  _includeThrottle(false),
  _includeAccelerator(false),
  _includeBrake(false),
  _includeSteering(false),
  hid(0)
{
  this->resetButtons();
  this->deviceName = deviceName;
  this->deviceManufacturer = deviceManufacturer;
  this->batteryLevel = batteryLevel;
  this->connectionStatus = new BleConnectionStatus();
}

void BleGamepad::resetButtons() {
  memset(&_buttons,0,sizeof(_buttons));
}

void BleGamepad::setControllerType(uint8_t controllerType){
	_controllerType = controllerType;
}
  
void BleGamepad::begin(uint16_t buttonCount, uint8_t hatSwitchCount, bool includeStart, bool includeSelect, bool includeMenu, bool includeHome, bool includeVolumeInc, bool includeVolumeDec, bool includeVolumeMute, bool includeXAxis, bool includeYAxis, bool includeZAxis, bool includeRzAxis, bool includeRxAxis, bool includeRyAxis, bool includeSlider1, bool includeSlider2, bool includeRudder, bool includeThrottle, bool includeAccelerator, bool includeBrake, bool includeSteering)
{
	_buttonCount = buttonCount;
	_hatSwitchCount = hatSwitchCount;
	
	_includeStart = includeStart;
	_includeSelect = includeSelect;
	_includeMenu = includeMenu;
	_includeHome = includeHome;
	_includeVolumeInc = includeVolumeInc;
	_includeVolumeDec = includeVolumeDec;
	_includeVolumeMute = includeVolumeMute;

	_includeXAxis = includeXAxis;
	_includeYAxis = includeYAxis;
	_includeZAxis = includeZAxis;
	_includeRzAxis = includeRzAxis;
	_includeRxAxis = includeRxAxis;
	_includeRyAxis = includeRyAxis;
	_includeSlider1 = includeSlider1;
	_includeSlider2 = includeSlider2;
	
	_includeRudder = includeRudder;
	_includeThrottle = includeThrottle;
	_includeAccelerator = includeAccelerator;
	_includeBrake = includeBrake;
	_includeSteering = includeSteering;

	if (_includeStart) { _specialButtonCount++; }
	if (_includeSelect) { _specialButtonCount++; }
	if (_includeMenu) { _specialButtonCount++; }
	if (_includeHome) { _specialButtonCount++; }
	if (_includeVolumeInc) { _specialButtonCount++; }
	if (_includeVolumeDec) { _specialButtonCount++; }
	if (_includeVolumeMute) { _specialButtonCount++; }

	uint8_t axisCount = 0;
	if (_includeXAxis){ axisCount++; }
	if (_includeYAxis){ axisCount++; }
	if (_includeZAxis){ axisCount++; }
	if (_includeRzAxis){ axisCount++; }
	if (_includeRxAxis){ axisCount++; }
	if (_includeRyAxis){ axisCount++; }
	if (_includeSlider1){ axisCount++; }
	if (_includeSlider2){ axisCount++; }
	
	uint8_t simulationCount = 0;
	if (_includeRudder){ simulationCount++; }
	if (_includeThrottle){ simulationCount++; }
	if (_includeAccelerator){ simulationCount++; }
	if (_includeBrake){ simulationCount++; }
	if (_includeSteering){ simulationCount++; }
	
	
	uint8_t buttonPaddingBits = 8 - (_buttonCount % 8);
	if(buttonPaddingBits == 8){buttonPaddingBits = 0;}
	uint8_t specialButtonPaddingBits = 8 - (_specialButtonCount % 8);
	if(specialButtonPaddingBits == 8){specialButtonPaddingBits = 0;}
	uint8_t numOfAxisBytes = axisCount * 2;
	uint8_t numOfSimulationBytes = simulationCount * 2;
	
	numOfButtonBytes = _buttonCount / 8;
	if( buttonPaddingBits > 0){numOfButtonBytes++;}

	uint8_t numOfSpecialButtonBytes = _specialButtonCount / 8;
	if( specialButtonPaddingBits > 0){numOfSpecialButtonBytes++;}
	
	reportSize = numOfButtonBytes + numOfSpecialButtonBytes + numOfAxisBytes + numOfSimulationBytes + _hatSwitchCount;
	
	
	// USAGE_PAGE (Generic Desktop)
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

	// USAGE (Joystick - 0x04; Gamepad - 0x05; Multi-axis Controller - 0x08)
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
	tempHidReportDescriptor[hidReportDescriptorSize++] = _controllerType;

	// COLLECTION (Application)
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

	// REPORT_ID (Default: 3)
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x85;
	tempHidReportDescriptor[hidReportDescriptorSize++] = _hidReportId;

	if (_buttonCount > 0){

		// USAGE_PAGE (Button)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;

		// LOGICAL_MINIMUM (0)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

		// LOGICAL_MAXIMUM (1)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

		// REPORT_SIZE (1)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

