lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
		uint8_t m[reportSize];
		
		memset(&m,0,sizeof(m));
		memcpy(&m, &_buttons, sizeof(_buttons));
		
		currentReportIndex+=numOfButtonBytes;

		if(_specialButtonCount > 0) { m[currentReportIndex++] = _specialButtons; }
		
 		if(_includeXAxis){ m[currentReportIndex++] = _x;	m[currentReportIndex++] = (_x >> 8); }
		if(_includeYAxis){ m[currentReportIndex++] = _y;	m[currentReportIndex++] = (_y >> 8); }
		if(_includeZAxis){ m[currentReportIndex++] = _z;	m[currentReportIndex++] = (_z >> 8); }
		if(_includeRzAxis){ m[currentReportIndex++] = _rZ; 	m[currentReportIndex++] = (_rZ >> 8); }
		if(_includeRxAxis){ m[currentReportIndex++] = _rX; 	m[currentReportIndex++] = (_rX >> 8); }
		if(_includeRyAxis){ m[currentReportIndex++] = _rY; 	m[currentReportIndex++] = (_rY >> 8); }
		
		if(_includeSlider1){ m[currentReportIndex++] = _slider1;	m[currentReportIndex++] = (_slider1 >> 8); }
		if(_includeSlider2){ m[currentReportIndex++] = _slider2;	m[currentReportIndex++] = (_slider2 >> 8); }
  
		if(_includeRudder){ m[currentReportIndex++] = _rudder;	m[currentReportIndex++] = (_rudder >> 8); }
		if(_includeThrottle){ m[currentReportIndex++] = _throttle;	m[currentReportIndex++] = (_throttle >> 8); }
		if(_includeAccelerator){ m[currentReportIndex++] = _accelerator;	m[currentReportIndex++] = (_accelerator >> 8); }
		if(_includeBrake){ m[currentReportIndex++] = _brake; 	m[currentReportIndex++] = (_brake >> 8); }
		if(_includeSteering){ m[currentReportIndex++] = _steering; 	m[currentReportIndex++] = (_steering >> 8); }
		
		if(_hatSwitchCount > 0)
		{
			signed char hats[4];
			
			hats[0] = _hat1;
			hats[1] = _hat2;
			hats[2] = _hat3;
			hats[3] = _hat4;
				
			for(int currentHatIndex = _hatSwitchCount -1 ; currentHatIndex >= 0 ; currentHatIndex--)
			{
				m[currentReportIndex++] = hats[currentHatIndex];
			}
		}
		
		this->inputGamepad->setValue(m, sizeof(m));
		this->inputGamepad->notify();
	}
}

void BleGamepad::press(uint8_t b)
{
  uint8_t index = (b-1) / 8;
  uint8_t bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint8_t result = _buttons[index] | bitmask;
  
  if (result != _buttons[index]) 
  {
	_buttons[index] = result;
  }
  
  if(_autoReport){ sendReport(); }
}

void BleGamepad::release(uint8_t b)
{
  uint8_t index = (b-1) / 8;
  uint8_t bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _buttons[index] & ~bitmask;
  
  if (result != _buttons[index]) 
  {
	_buttons[index] = result;
  }
  
  if(_autoReport){ sendReport(); }

}

void BleGamepad::pressSpecialButton(uint8_t b)
{
  uint8_t bit = b % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _specialButtons | bitmask;
  
  if (result != _specialButtons) 
  {
	_specialButtons = result;
  }
  
  if(_autoReport){ sendReport(); }
}

void BleGamepad::releaseSpecialButton(uint8_t b)
{
  uint8_t bit = b % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _specialButtons & ~bitmask;
  
  if (result != _specialButtons) 
  {
	_specialButtons = result;
  }
  
  if(_autoReport){ sendReport(); }
}

void BleGamepad::setLeftThumb(int16_t x, int16_t y)
{
	if(x == -32768) { x = -32767; }
	if(y == -32768) { y = -32767; }
	
	_x = x;
	_y = y;
	
	if(_autoReport){ sendReport(); }
}
void BleGamepad::setRightThumb(int16_t z, int16_t rZ)
{
	if(z == -32768) { z = -32767; }
	if(rZ == -32768) { rZ = -32767; }
	
	_z = z;
	_rZ = rZ;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setLeftTrigger(int16_t rX)
{
	if(rX == -32768) {rX = -32767; }
	
	_rX = rX;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setRightTrigger(int16_t rY)
{
	if(rY == -32768) {rY = -32767; }
	
	_rY = rY;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setTriggers(int16_t rX, int16_t rY)
{
	if(rX == -32768) {rX = -32767; }
	if(rY == -32768) {rY = -32767; }
	
	_rX = rX;
	_rY = rY;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setHat(signed char hat)
{
	_hat1 = hat;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setHat1(signed char hat1)
{
	_hat1 = hat1;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setHat2(signed char hat2)
{
	_hat2 = hat2;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setHat3(signed char hat3)
{
	_hat3 = hat3;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setHat4(signed char hat4)
{
	_hat4 = hat4;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setX(int16_t x)
{
	if(x == -32768) { x = -32767; }

	_x = x;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setY(int16_t y)
{
	if(y == -32768) { y = -32767; }
	
	_y = y;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setZ(int16_t z)
{
	if(z == -32768) { z = -32767; }
	
	_z = z;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setRZ(int16_t rZ)
{
	if(rZ == -32768) { rZ = -32767; }
	
	_rZ = rZ;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setRX(int16_t rX)
{
	if(rX == -32768) { rX = -32767; }
	
	_rX = rX;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setRY(int16_t rY)
{
	if(rY == -32768) { rY = -32767; }
	
	_rY = rY;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setSlider(int16_t slider)
{
	if(slider == -32768) { slider = -32767; }
	
	_slider1 = slider;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setSlider1(int16_t slider1)
{
	if(slider1 == -32768) { slider1 = -32767; }
	
	_slider1 = slider1;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setSlider2(int16_t slider2)
{
	if(slider2 == -32768) { slider2 = -32767; }
	
	_slider2 = slider2;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setRudder(int16_t rudder)
{
	if(rudder == -32768) { rudder = -32767; }
	
	_rudder = rudder;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setThrottle(int16_t throttle)
{
	if(throttle == -32768) { throttle = -32767; }
	
	_throttle = throttle;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setAccelerator(int16_t accelerator)
{
	if(accelerator == -32768) { accelerator = -32767; }
	
	_accelerator = accelerator;
	
	if(_autoReport){ sendReport(); }
}

void BleGamepad::setBrake(int16_t brake)
{
	if(brake == -32768) { brake = -32767; }
	
